import plotly.express as px


geojson = px.data.election_geojson() #  получение объекта GeoJSON для визуализации данных выборов

# загрузим набор данных
df = px.data.election()


fig = px.choropleth(data_frame=df, geojson=geojson, color="Joly",
                locations="district", featureidkey="properties.district",
                projection="mercator")

# строим карту
fig.update_geos(fitbounds="locations", visible=False)
# задаем отступы
fig.update_layout(margin={"r": 0, "t": 0, "l": 0, "b": 0})

fig.show()





# 0 101-Буа-де-Льес 2481 1829 3024 7334 множество Жоли 101
# 1 102-Кап-Сен-Жак 2525 1163 2675 6363 множество Жоли 102
# 2 11 111 -Буа-де-Льес.
#  -Су-о-Реколле 3348 2770 2532 8650 Большинство Кодерра 11
# № 3 111-Майл-Энд 1734 4782 2514 9030 большинство Бержерона 111
# № 4 112-Делоримье 1770 5933 3044 10747 Большинство Бержерона 112
# № 5 113-Жанна-Манс 1455 3599 2316 7370 Большинство Бержерона 113
# № 6 12-Сен-Сюльпис 3252 2521 2543 8316 Большинство Кодерра 12
# № 7 121-Ла-Пуэнт- о-Прери 5456 1760 3330 10546 Кодер большинством 121
# № 8 122-Пуэнт-о-Трембль 4734 1879 2852 9465 Кодер большинством 122
# № 9 123-Ривьер-де-Прери 5737 958 1656 8351 Кодер большинством 123